export const questionSets = {
  common: [
    {
      text: "佐藤先生の名前は？",
      choices: ["勇気", "祐樹", "祐基", "裕基"],
      answer: "裕基"
    },
    {
      text: "野沢温泉中学校が開校したのは？",
      choices: ["1973年", "1978年", "1983年", "1988年"],
      answer: "1983年"
    },
    {
      text: "野沢温泉中学校の標高は？",
      choices: ["390m", "490m", "590m", "690m"],
      answer: "490m"
    },
    {
      text: "校歌の中で一度も出てこない言葉はどれ？",
      choices: ["努力", "青春", "友情", "平和"],
      answer: "努力"
    },
    {
      text: "校長先生が好きな食べ物は何？",
      choices: ["カレー", "ラーメン", "焼肉", "パスタ"],
      answer: "カレー"
    },
    {
      text: "校長先生が中学生のころ得意だった教科は何？",
      choices: ["国語", "英語", "理科", "社会"],
      answer: "英語"
    },
    {
      text: "校長先生が学生時代にしていないアルバイトはどれ？",
      choices: ["警備", "コンビニ", "工場", "居酒屋"],
      answer: "居酒屋"
    }
  ],

  grade1: [
    {
      text: "森川先生が好きでない食べ物は次のうちどれ？",
      choices: ["オムライス", "サバの味噌煮", "アヒージョ", "かぶ"],
      answer: "かぶ"
    },
    {
      text: "森川先生が好きなアーティストはどれ？",
      choices: ["King Gnu", "Official髭男dism", "西野カナ", "Mrs.GREEN APPLE"],
      answer: "Official髭男dism"
    },
    {
      text: "森川先生が教師以外でなりたいものではない職業はどれ？",
      choices: ["イタリアンの店員", "YouTuber", "お笑い芸人", "ディズニーのキャストさん"],
      answer: "イタリアンの店員"
    },
    {
      text: "西澤先生の好きな食べ物は次のうちどれ？",
      choices: ["オムライス", "焼きそば", "牛丼", "チャーハン"],
      answer: "チャーハン"
    },
    {
      text: "西澤先生が中学生のころ得意だった教科は何？",
      choices: ["理科", "数学", "社会", "英語"],
      answer: "理科"
    },
    {
      text: "西澤先生が学生時代にしていたアルバイトはどれ？",
      choices: ["カフェ店員", "ガソリンスタンドの店員", "レストランのホール", "書店スタッフ"],
      answer: "理科"
    }
  ],

  grade2: [
    {
      text: "宮澤先生の好きな食べ物は次のうちどれ？",
      choices: ["ポテトチップス", "チョコレート", "アイスクリーム", "グミ"],
      answer: "チョコレート"
    },
    {
      text: "宮澤先生が学生時代にしていたアルバイトはどれ？",
      choices: ["スイミングスクールのコーチ", "カラオケ店スタッフ", "スポーツ用品店店員", "ゲームセンタースタッフ"],
      answer: "スイミングスクールのコーチ"
    },
    {
      text: "宮島先生が好きな食べ物で挙げなかったものは次のうちどれ？",
      choices: ["ケーキ", "プリン", "どら焼き", "シュークリーム"],
      answer: "どら焼き"
    },
    {
      text: "宮島先生が好きなアーティストで挙げなかったものは次のうちどれ？",
      choices: ["中島みゆき", "松任谷由実", "ブルーハーツ", "QUEEN"],
      answer: "中島みゆき"
    },
    {
      text: "小林先生の趣味は次のうちどれ？",
      choices: ["金魚鑑賞", "金魚の池の掃除", "金魚釣り", "金魚の餌やり"],
      answer: "金魚の池の掃除"
    },
    {
      text: "小林先生が教師以外でなりたいものではない職業はどれ？",
      choices: ["マクドナルドの店員", "焼きそば屋さん", "たこ焼き屋さん", "カフェの店員"],
      answer: "金魚の池の掃除"
    }
  ],

  grade3: [
    {
      text: "(x+2)(x+3) を展開すると？",
      choices: [
        "x²+5x+6",
        "x²+6x+5",
        "x²+5x+5",
        "x²+6"
      ],
      answer: "x²+5x+6"
    }
  ]
};