// 質問内容
export const questionSets = {
  common: [
    {
      text: "佐藤先生の名前は？",
      choices: ["勇気", "祐樹", "祐基", "裕基"],
      answer: "裕基"
    },
    {
      text: "野沢温泉中学校が開校したのは？",
      choices: ["1973年", "1978年", "1983年", "1988年"],
      answer: "1983年"
    },
    {
      text: "野沢温泉中学校の標高は？",
      choices: ["390m", "490m", "590m", "690m"],
      answer: "490m"
    },
    {
      text: "校歌の中で一度も出てこない言葉はどれ？",
      choices: ["努力", "青春", "友情", "平和"],
      answer: "努力"
    },
    {
      text: "校長先生が好きな食べ物は何？",
      choices: ["カレー", "ラーメン", "焼肉", "パスタ"],
      answer: "カレー"
    },
    {
      text: "校長先生が中学生のころ得意だった教科は何？",
      choices: ["国語", "英語", "理科", "社会"],
      answer: "英語"
    },
    {
      text: "校長先生が学生時代にしていないアルバイトはどれ？",
      choices: ["警備", "コンビニ", "工場", "居酒屋"],
      answer: "居酒屋"
    }
  ],

  grade1: [
    {
      text: "森川先生が好きでない食べ物は次のうちどれ？",
      choices: ["オムライス", "サバの味噌煮", "アヒージョ", "かぶ"],
      answer: "かぶ"
    },
    {
      text: "森川先生が好きなアーティストはどれ？",
      choices: ["King Gnu", "Official髭男dism", "西野カナ", "Mrs.GREEN APPLE"],
      answer: "Official髭男dism"
    },
    {
      text: "森川先生が教師以外でなりたいものではない職業はどれ？",
      choices: ["イタリアンの店員", "YouTuber", "お笑い芸人", "ディズニーのキャストさん"],
      answer: "イタリアンの店員"
    },
    {
      text: "西澤先生の好きな食べ物は次のうちどれ？",
      choices: ["オムライス", "焼きそば", "牛丼", "チャーハン"],
      answer: "チャーハン"
    },
    {
      text: "西澤先生が中学生のころ得意だった教科は何？",
      choices: ["理科", "数学", "社会", "英語"],
      answer: "理科"
    },
    {
      text: "西澤先生が学生時代にしていたアルバイトはどれ？",
      choices: ["カフェ店員", "ガソリンスタンドの店員", "レストランのホール", "書店スタッフ"],
      answer: "レストランのホール"
    },
    {
      text: "-4a+3b-(a-b)の値は次のうちどれ？",
      choices: ["-5a+4b", "-3a+2b", "-5a+2b", "-3a+4b"],
      answer: "-5a+4b"
    }
  ],

  grade2: [
    {
      text: "宮澤先生の好きな食べ物は次のうちどれ？",
      choices: ["ポテトチップス", "チョコレート", "アイスクリーム", "グミ"],
      answer: "チョコレート"
    },
    {
      text: "宮澤先生が学生時代にしていたアルバイトはどれ？",
      choices: ["スイミングスクールのコーチ", "カラオケ店スタッフ", "スポーツ用品店店員", "ゲームセンタースタッフ"],
      answer: "スイミングスクールのコーチ"
    },
    {
      text: "宮島先生が好きな食べ物で挙げなかったものは次のうちどれ？",
      choices: ["ケーキ", "プリン", "どら焼き", "シュークリーム"],
      answer: "どら焼き"
    },
    {
      text: "宮島先生が好きなアーティストで挙げなかったものは次のうちどれ？",
      choices: ["中島みゆき", "松任谷由実", "ブルーハーツ", "QUEEN"],
      answer: "中島みゆき"
    },
    {
      text: "小林先生の趣味は次のうちどれ？",
      choices: ["金魚鑑賞", "金魚の池の掃除", "金魚釣り", "金魚の餌やり"],
      answer: "金魚の池の掃除"
    },
    {
      text: "小林先生が教師以外でなりたいものではない職業はどれ？",
      choices: ["マクドナルドの店員", "焼きそば屋さん", "たこ焼き屋さん", "カフェの店員"],
      answer: "焼きそば屋さん"
    }
  ],

  grade3: [
    {
      text: "清水先生が好きな食べ物であげなかったものはどれ？",
      choices: ["寿司", "スイカ", "ビール", "日本酒"],
      answer: "ビール"
    },
    {
      text: "清水先生が教師以外でなりたい職業で挙げなかったものは次のうちどれ？",
      choices: ["カーレーサー", "歌手", "システムエンジニア", "居酒屋"],
      answer: "歌手"
    },
    {
      text: "ロス先生の好きな食べ物は次のうちどれ？",
      choices: ["ラザニア", "キッシュ", "エスカルゴ", "ドリア"],
      answer: "キッシュ"
    },
    {
      text: "ロス先生が教師以外になりたいものは次のうちどれ？",
      choices: ["キャビンアテンダント", "観光案内所", "英会話教室", "伝統工芸士"],
      answer: "伝統工芸士"
    },
    {
      text: "水野先生の好きな食べ物は次のうちどれ？",
      choices: ["ティラミス", "クレープ", "パフェ", "かりんとう"],
      answer: "ティラミス"
    },
    {
      text: "水野先生が中学生時代に得意だった教科は次のうちどれ？",
      choices: ["国語", "数学", "英語", "社会"],
      answer: "英語"
    },
    {
      text: "滝沢先生が好きな食べ物であげなかったものは次のうちどれ？",
      choices: ["寿司", "カレー", "エビフライ", "チョコレート"],
      answer: "カレー"
    },
    {
      text: "滝沢先生の趣味は次のうちどれ？",
      choices: ["観葉植物のお世話", "縄跳び", "お茶をたてる", "愛犬と遊ぶ"],
      answer: "愛犬と遊ぶ"
    },
    {
      text: "√49 の値は？",
      choices: ["-7", "±7", "7", "49"],
      answer: "±7"
    }
  ]
};